In [1]:
# pandas in Python

In [2]:
# install pandas 
%pip install pandas

Requirement already satisfied: pandas in c:\users\programming\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\programming\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\programming\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\programming\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\programming\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\programming\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
print(pd.__version__)

2.2.3

In [4]:
# create a series 

data = [10,20,30,40,50,60]

series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [5]:
my_index = ['a','b','c','d','e','f']

s = pd.Series(data,index=my_index)
print(s)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [6]:
# create a dataframe

my_data = {
    'name':['rahul','niraj','nidhini','tanveesh'],
    'age':[25,23,26,30],
    'city':['mumbai','pune','goa','bhuj']
}

df = pd.DataFrame(my_data)
print(df)

       name  age    city
0     rahul   25  mumbai
1     niraj   23    pune
2   nidhini   26     goa
3  tanveesh   30    bhuj

In [7]:
df = pd.read_csv('dataset/employee.csv')
print(df)

                Name     Salary          City  Age   Department Date of Join  \
0       Emily Harris   85432.45      New York   35    Marketing   14-03-2017
1       Jacob Wright   60523.12       Houston   29  Engineering   10-06-2019
2     Olivia Johnson   72345.00       Chicago   42           HR   23-09-2015
3     Ethan Thompson   38900.78       Phoenix   26      Support   05-02-2021
4       Ava Martinez  112300.00   Los Angeles   38      Finance   17-07-2013
5   William Anderson   51200.65  Philadelphia   31        Sales   30-12-2020
6       Sophia Clark   78000.30       Houston   45    Marketing   12-08-2016
7        James Lewis   44789.99       Chicago   28      Support   09-01-2022
8    Isabella Walker   91000.55      New York   37  Engineering   03-04-2018
9   Michael Robinson   69500.00       Phoenix   33           HR   15-11-2014
10   Charlotte Adams   76500.20       Chicago   34        Sales   24-05-2016
11   Benjamin Turner   83220.45       Houston   40  Engineering   02-11-2017
12   Amelia Mitchell   49000.99      New York   27           HR   18-03-2020
13       Lucas Perez  103200.75       Phoenix   44      Finance   01-12-2015
14        Mia Carter   58840.10  Philadelphia   30      Support   27-07-2021
15     Henry Ramirez   69000.50   Los Angeles   36    Marketing   06-10-2014
16     Harper Brooks   61000.00      New York   32  Engineering   10-09-2018
17     Daniel Murphy   74020.60       Chicago   41           HR   25-04-2013
18       Evelyn Bell   85800.75       Houston   39        Sales   19-08-2016
19    Matthew Cooper   44200.00       Phoenix   26      Support   14-06-2022
20      Abigail Reed   97500.95  Philadelphia   35      Finance   07-03-2015
21    Jackson Bailey   55200.89   Los Angeles   29    Marketing   30-12-2020
22    Scarlett Kelly   61800.30       Chicago   33        Sales   11-01-2019
23      Aiden Rivera   80500.22       Houston   38  Engineering   28-02-2017
24        Ella James   47000.40      New York   28           HR   05-10-2021
25      David Morgan  109000.00       Phoenix   45      Finance   22-08-2012
26        Grace Diaz   58300.75  Philadelphia   31      Support   13-04-2023
27       Joseph Hall   69500.33   Los Angeles   37    Marketing   19-01-2016
28        Chloe Ward   71200.66       Chicago   34        Sales   20-07-2018
29     Samuel Torres   82000.40       Houston   42  Engineering   17-06-2014

   Employee Code
0        EMP1000
1        EMP1001
2        EMP1002
3        EMP1003
4        EMP1004
5        EMP1005
6        EMP1006
7        EMP1007
8        EMP1008
9        EMP1009
10       EMP1100
11       EMP1101
12       EMP1102
13       EMP1103
14       EMP1104
15       EMP1105
16       EMP1106
17       EMP1107
18       EMP1108
19       EMP1109
20       EMP1110
21       EMP1111
22       EMP1112
23       EMP1113
24       EMP1114
25       EMP1115
26       EMP1116
27       EMP1117
28       EMP1118
29       EMP1119

In [8]:
# display first 2
print(df.head(2))

           Name    Salary      City  Age   Department Date of Join  \
0  Emily Harris  85432.45  New York   35    Marketing   14-03-2017
1  Jacob Wright  60523.12   Houston   29  Engineering   10-06-2019

  Employee Code
0       EMP1000
1       EMP1001

In [9]:
# get basic info 
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   Salary         30 non-null     float64
 2   City           30 non-null     object
 3   Age            30 non-null     int64
 4   Department     30 non-null     object
 5   Date of Join   30 non-null     object
 6   Employee Code  30 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 1.8+ KB
None

In [10]:
# get summary statistics 
print(df.describe())

              Salary        Age
count      30.000000  30.000000
mean    71359.402667  34.833333
std     19398.163795   5.736053
min     38900.780000  26.000000
25%     58435.587500  30.250000
50%     70350.495000  34.500000
75%     82915.437500  38.750000
max    112300.000000  45.000000

In [11]:
# get all column 
print(df.columns)

Index(['Name', 'Salary', 'City', 'Age', 'Department', 'Date of Join',
       'Employee Code'],
      dtype='object')

In [12]:
# get single column
print(df['Name'])

0         Emily Harris
1         Jacob Wright
2       Olivia Johnson
3       Ethan Thompson
4         Ava Martinez
5     William Anderson
6         Sophia Clark
7          James Lewis
8      Isabella Walker
9     Michael Robinson
10     Charlotte Adams
11     Benjamin Turner
12     Amelia Mitchell
13         Lucas Perez
14          Mia Carter
15       Henry Ramirez
16       Harper Brooks
17       Daniel Murphy
18         Evelyn Bell
19      Matthew Cooper
20        Abigail Reed
21      Jackson Bailey
22      Scarlett Kelly
23        Aiden Rivera
24          Ella James
25        David Morgan
26          Grace Diaz
27         Joseph Hall
28          Chloe Ward
29       Samuel Torres
Name: Name, dtype: object

In [13]:
# get more column 
print(df[['Name','Salary']])

                Name     Salary
0       Emily Harris   85432.45
1       Jacob Wright   60523.12
2     Olivia Johnson   72345.00
3     Ethan Thompson   38900.78
4       Ava Martinez  112300.00
5   William Anderson   51200.65
6       Sophia Clark   78000.30
7        James Lewis   44789.99
8    Isabella Walker   91000.55
9   Michael Robinson   69500.00
10   Charlotte Adams   76500.20
11   Benjamin Turner   83220.45
12   Amelia Mitchell   49000.99
13       Lucas Perez  103200.75
14        Mia Carter   58840.10
15     Henry Ramirez   69000.50
16     Harper Brooks   61000.00
17     Daniel Murphy   74020.60
18       Evelyn Bell   85800.75
19    Matthew Cooper   44200.00
20      Abigail Reed   97500.95
21    Jackson Bailey   55200.89
22    Scarlett Kelly   61800.30
23      Aiden Rivera   80500.22
24        Ella James   47000.40
25      David Morgan  109000.00
26        Grace Diaz   58300.75
27       Joseph Hall   69500.33
28        Chloe Ward   71200.66
29     Samuel Torres   82000.40

In [14]:
# filter 
print(df[df['Age'] > 40])

              Name     Salary     City  Age   Department Date of Join  \
2   Olivia Johnson   72345.00  Chicago   42           HR   23-09-2015
6     Sophia Clark   78000.30  Houston   45    Marketing   12-08-2016
13     Lucas Perez  103200.75  Phoenix   44      Finance   01-12-2015
17   Daniel Murphy   74020.60  Chicago   41           HR   25-04-2013
25    David Morgan  109000.00  Phoenix   45      Finance   22-08-2012
29   Samuel Torres   82000.40  Houston   42  Engineering   17-06-2014

   Employee Code
2        EMP1002
6        EMP1006
13       EMP1103
17       EMP1107
25       EMP1115
29       EMP1119

In [19]:
# Modifying Data
my_data = {
    'name':['rahul','niraj','nidhini','tanveesh'],
    'age':[25,23,26,30],
    'city':['mumbai','pune','goa','bhuj']
}

df = pd.DataFrame(my_data)
print(df)

df['Salary'] = [50000,60000,75000,5000]
print(df)

       name  age    city
0     rahul   25  mumbai
1     niraj   23    pune
2   nidhini   26     goa
3  tanveesh   30    bhuj
       name  age    city  Salary
0     rahul   25  mumbai   50000
1     niraj   23    pune   60000
2   nidhini   26     goa   75000
3  tanveesh   30    bhuj    5000

In [20]:
# update value
df['age'] =df['age']+2
print(df)

       name  age    city  Salary
0     rahul   27  mumbai   50000
1     niraj   25    pune   60000
2   nidhini   28     goa   75000
3  tanveesh   32    bhuj    5000

In [21]:
# drop the column 
df = df.drop('Salary',axis=1)
print(df)

       name  age    city
0     rahul   27  mumbai
1     niraj   25    pune
2   nidhini   28     goa
3  tanveesh   32    bhuj

In [22]:
# group by city and calculate mean Age
print(df.groupby('city')['age'].mean())

city
bhuj      32.0
goa       28.0
mumbai    27.0
pune      25.0
Name: age, dtype: float64

In [23]:
df.to_csv("data.csv",index=False)